x = max(5, 2 ,3)
y = min(72, 22, 223)
print(x)
print(y)

#Функция возвращает абсолютное (положительное) значение указанного числа:abs()
x = float(input())
print(abs(x))

#Вернем значение 4 в степень 3 (то же, что и 4 * 4 * 4):
x = pow(4,3)
print(x)

#Метод, например, возвращает квадратный корень из числа:math.sqrt()
import math 
x = math.sqrt(64)
print(x)

#Метод округляет число в большую сторону до его ближайшего целого числа: math.ceil()
#метод округляет число в меньшую сторону до ближайшего целого числа и возвращает результат: math.floor()